In [1]:
import pandas as pd

In [2]:
city_data = {
    'Город':['Москва', 'Казань', 'Владивосток', 'Санкт-Петербург', 'Калининград'], 
    'Дата основания':['1147', '1005', '1860', '1703', '1255'], 
    'Площадь':['2511', '516', '331', '1439', '223'], 
    'Население':['11,9', '1,2', '0,6', '4,9', '0,4'], 
    'Погода':['8', '8', '17', '9', '12'] }

In [3]:
city_df = pd.DataFrame(city_data)

In [4]:
city_df

             Город Дата основания Площадь Население Погода
0           Москва           1147    2511      11,9      8
1           Казань           1005     516       1,2      8
2      Владивосток           1860     331       0,6     17
3  Санкт-Петербург           1703    1439       4,9      9
4      Калининград           1255     223       0,4     12

In [5]:
city_df.drop(labels = [2],axis = 0)

             Город Дата основания Площадь Население Погода
0           Москва           1147    2511      11,9      8
1           Казань           1005     516       1,2      8
3  Санкт-Петербург           1703    1439       4,9      9
4      Калининград           1255     223       0,4     12

In [6]:
city_df.drop(labels = [2,3],axis = 0)

         Город Дата основания Площадь Население Погода
0       Москва           1147    2511      11,9      8
1       Казань           1005     516       1,2      8
4  Калининград           1255     223       0,4     12

In [7]:
city_df.drop(labels = [4],axis = 0, inplace = True)

In [8]:
city_df

             Город Дата основания Площадь Население Погода
0           Москва           1147    2511      11,9      8
1           Казань           1005     516       1,2      8
2      Владивосток           1860     331       0,6     17
3  Санкт-Петербург           1703    1439       4,9      9

In [9]:
city_df = city_df.set_index('Город')

In [10]:
city_df

                Дата основания Площадь Население Погода
Город
Москва                    1147    2511      11,9      8
Казань                    1005     516       1,2      8
Владивосток               1860     331       0,6     17
Санкт-Петербург           1703    1439       4,9      9

In [11]:
city_df.drop(['Казань'],axis = 0)

                Дата основания Площадь Население Погода
Город
Москва                    1147    2511      11,9      8
Владивосток               1860     331       0,6     17
Санкт-Петербург           1703    1439       4,9      9

In [12]:
city_df.drop(['Казань','Владивосток'],axis = 0)

                Дата основания Площадь Население Погода
Город
Москва                    1147    2511      11,9      8
Санкт-Петербург           1703    1439       4,9      9

In [13]:
city_df['Площадь'] = pd.to_numeric(city_df['Площадь'])

In [14]:
city_df['Площадь']

Город
Москва             2511
Казань              516
Владивосток         331
Санкт-Петербург    1439
Name: Площадь, dtype: int64

In [15]:
city_df = city_df.loc[city_df['Площадь'] > 1000]

In [16]:
city_df

                Дата основания  Площадь Население Погода
Город
Москва                    1147     2511      11,9      8
Санкт-Петербург           1703     1439       4,9      9